Revit 2027 API
PipePlumbingFixtureFlowData.DimensionFlow Property
 The dimension flow which is used to calculate flow of the pipe. Units: (gal/min).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DimensionFlow { get; }
Public ReadOnly Property DimensionFlow As Double
	Get
public:
property double DimensionFlow {
	double get ();
}
member DimensionFlow : float with get
Property Value
Double
See Also
Reference
PipePlumbingFixtureFlowData Class
Autodesk.Revit.DB.Plumbing Namespace